app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(params[:school_class])
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]

  def update
    @school_class = SchoolClass.new(params[:school_class])
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Risk Analysis"], ["room_number", 10]]