app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-02-26 18:47:54.923095"], ["updated_at", "2019-02-26 18:47:54.923095"]]
---
  def create
    @student = Student.create(params[:student])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2019-02-26 18:53:20.755439"], ["updated_at", "2019-02-26 18:53:20.755439"]]
---
  def update
    @student = Student.new(params[:student])
    @student.save